public class Main {
    public static void main(String[] args) {
        int ticket = 15000; // цена билета
        int mile = 20; // количество рублей для одной бонусной мили
        int bonus = ticket / mile;
        System.out.println("Бонус:" + bonus);

               // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}